package day03;

/**
 * 位运算符用法>>,>>>,<<
 */
public class Demo5_Operator {
    public static void main(String[] args) {

        //左移，向左移动几位就是乘以2的几次幂
        System.out.println(12<<1);//->24
        System.out.println(12<<2);//-> 48
        /**
         * 00000000 00000000 00000000 00001100 12
         * 00000000 00000000 00000000 00011000 24
         * 00000000 00000000 00000000 00110000 48
         */

        //右移,向右移动几位就是除以二的几次幂
        System.out.println(12>>1);// ->6
        System.out.println(12>>2);// ->3
        /**
         * 最高位是0就补0，是一就补1
         * 00000000 00000000 00000000 00001100 12
         * 00000000 00000000 00000000 00000110 6
         * 00000000 00000000 00000000 00000011 3
         */

        /**
         * >>>最高位补0
         */

        //最高效率算出2*8
        System.out.println(2<<3);

    }
}
