package day03;

/**
 * 位运算符的用法
 */
public class Demo3_Operator {
    public static void main(String[] args) {
        /**
         * &,|,^,~用法
         * &：有0则0
         * |：有1则1
         * ^：相同则0，不同则1
         * ~：按位取反
         */
        /**
         * 110
         * 011
         * &------
         * 010
         *
         *
         */
        System.out.println(6&3);//->2
         /**
         * 110
         * 011
         * |------
         * 111
         *
         *
         */
        System.out.println(6|3);//->7
         /**
         * 110
         * 011
         * ^------
         * 010
         *
         *
         */
        System.out.println(6^3);//->2
         /**
          * 00000000 00000000 00000000 00000110 6的源码
          *补码
          * 取反
          * 11111111 11111111 11111111 11111001
          * 补码-1
          * 11111111 11111111 11111111 11111000  反码
          * 10000000 00000000 00000000 00000111
          *
         *
         *
         */
        System.out.println(~6);//->  -7





    }
}
